package com.price.finance_recorder_cmn;

public class FinanceRecorderCmnDefStockDatabase
{
	static final String[] COMPANY_DEPOSITORY_SHAREHOLDER_DISTRIBUTION_TABLE_FIELD_DEFINITION = new String[]
	{
		"date", // 日期
		"value1", // 持股1-999人數
		"value2", // 持股1-999股數
		"value3", // 持股1-999佔集保庫存數比例
		"value4", // 持股1,000-5,000人數
		"value5", // 持股1,000-5,000股數
		"value6", // 持股1,000-5,000佔集保庫存數比例
		"value7", // 持股5,001-10,000人數
		"value8", // 持股5,001-10,000股數
		"value9", // 持股5,001-10,000佔集保庫存數比例
		"value10", // 持股10,001-15,000人數
		"value11", // 持股10,001-15,000股數
		"value12", // 持股10,001-15,000佔集保庫存數比例
		"value13", // 持股15,001-20,000人數
		"value14", // 持股15,001-20,000股數
		"value15", // 持股15,001-20,000佔集保庫存數比例
		"value16", // 持股20,001-30,000人數
		"value17", // 持股20,001-30,000股數
		"value18", // 持股20,001-30,000佔集保庫存數比例
		"value19", // 持股30,001-40,000人數
		"value20", // 持股30,001-40,000股數
		"value21", // 持股30,001-40,000佔集保庫存數比例
		"value22", // 持股40,001-50,000人數
		"value23", // 持股40,001-50,000股數
		"value24", // 持股40,001-50,000佔集保庫存數比例
		"value25", // 持股50,001-100,000人數
		"value26", // 持股50,001-100,000股數
		"value27", // 持股150,001-100,000佔集保庫存數比例
		"value28", // 持股100,001-200,000人數
		"value29", // 持股100,001-200,000股數
		"value30", // 持股100,001-200,000佔集保庫存數比例
		"value31", // 持股200,001-400,000人數
		"value32", // 持股200,001-400,000股數
		"value33", // 持股200,001-400,000佔集保庫存數比例
		"value34", // 持股400,001-600,000人數
		"value35", // 持股400,001-600,000股數
		"value36", // 持股400,001-600,000佔集保庫存數比例
		"value37", // 持股600,001-800,000人數
		"value38", // 持股600,001-800,000股數
		"value39", // 持股600,001-800,000佔集保庫存數比例
		"value40", // 持股800,001-1,000,000人數
		"value41", // 持股800,001-1,000,000股數
		"value42", // 持股800,001-1,000,000佔集保庫存數比例
		"value43", // 持股1,000,001以上人數
		"value44", // 持股1,000,001以上股數
		"value45", // 持股1,000,001以上佔集保庫存數比例
		"value46", // 合計人數
		"value47", // 合計股數
		"value48", // 合計佔集保庫存數比例
	};
	static final String[] COMPANY_DEPOSITORY_SHAREHOLDER_DISTRIBUTION_TABLE_FIELD_TYPE_DEFINITION = new String[]
	{
		"DATE NOT NULL PRIMARY KEY", // 日期
		"INT", // 持股1-999人數
		"BIGINT", // 持股1-999股數
		"FLOAT", // 持股1-999佔集保庫存數比例
		"INT", // 持股1,000-5,000人數
		"BIGINT", // 持股1,000-5,000股數
		"FLOAT", // 持股1,000-5,000佔集保庫存數比例
		"INT", // 持股5,001-10,000人數
		"BIGINT", // 持股5,001-10,000股數
		"FLOAT", // 持股5,001-10,000佔集保庫存數比例
		"INT", // 持股10,001-15,000人數
		"BIGINT", // 持股10,001-15,000股數
		"FLOAT", // 持股10,001-15,000佔集保庫存數比例
		"INT", // 持股15,001-20,000人數
		"BIGINT", // 持股15,001-20,000股數
		"FLOAT", // 持股15,001-20,000佔集保庫存數比例
		"INT", // 持股20,001-30,000人數
		"BIGINT", // 持股20,001-30,000股數
		"FLOAT", // 持股20,001-30,000佔集保庫存數比例
		"INT", // 持股30,001-40,000人數
		"BIGINT", // 持股30,001-40,000股數
		"FLOAT", // 持股30,001-40,000佔集保庫存數比例
		"INT", // 持股40,001-50,000人數
		"BIGINT", // 持股40,001-50,000股數
		"FLOAT", // 持股40,001-50,000佔集保庫存數比例
		"INT", // 持股50,001-100,000人數
		"BIGINT", // 持股50,001-100,000股數
		"FLOAT", // 持股150,001-100,000佔集保庫存數比例
		"INT", // 持股100,001-200,000人數
		"BIGINT", // 持股100,001-200,000股數
		"FLOAT", // 持股100,001-200,000佔集保庫存數比例
		"INT", // 持股200,001-400,000人數
		"BIGINT", // 持股200,001-400,000股數
		"FLOAT", // 持股200,001-400,000佔集保庫存數比例
		"INT", // 持股400,001-600,000人數
		"BIGINT", // 持股400,001-600,000股數
		"FLOAT", // 持股400,001-600,000佔集保庫存數比例
		"INT", // 持股600,001-800,000人數
		"BIGINT", // 持股600,001-800,000股數
		"FLOAT", // 持股600,001-800,000佔集保庫存數比例
		"INT", // 持股800,001-1,000,000人數
		"BIGINT", // 持股800,001-1,000,000股數
		"FLOAT", // 持股800,001-1,000,000佔集保庫存數比例
		"INT", // 持股1,000,001以上人數
		"BIGINT", // 持股1,000,001以上股數
		"FLOAT", // 持股1,000,001以上佔集保庫存數比例
		"INT", // 合計人數
		"BIGINT", // 合計股數
		"FLOAT", // 合計佔集保庫存數比例
	};
}
